Revit 2026 API

# SolidIntersectWithCurve Method

---

Calculates and returns the intersection between a curve and this solid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SolidCurveIntersection IntersectWithCurve(
	Curve curve,
	SolidCurveIntersectionOptions options
)
```
```vb
Public Function IntersectWithCurve (
	curve As Curve,
	options As SolidCurveIntersectionOptions
) As SolidCurveIntersection
```
```cpp
public:
SolidCurveIntersection^ IntersectWithCurve(
	Curve^ curve,
	SolidCurveIntersectionOptions^ options
)
```
```fsharp
member IntersectWithCurve :
        curve : Curve *
        options : SolidCurveIntersectionOptions -> SolidCurveIntersection
```

#### Parameters

curve Curve
     The curve.
options SolidCurveIntersectionOptions
     The options. If NULL, the default options will be used.

#### Return Value

SolidCurveIntersection The intersection results.

| Exception | Condition |
| --- | --- |
| ArgumentException | The input curve is not bound. -or- The input solid is not a closed volume. |
| ArgumentNullException | A non-optional argument was NULL |

#### Reference

Solid Class

Autodesk.Revit.DB Namespace